app/controllers/subjects_controller.rb

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
  def show
    @subject = Subject.find(params[:id])

INSERT INTO `subjects` (`name`, `position`, `created_at`, `updated_at`) VALUES ('xxxx', 8, '2017-01-09 21:00:13', '2017-01-09 21:00:13')
---
 def create
    # Instantiate a new object using form parameters
    @subject = Subject.new(subject_params)
    # Save the object
    if @subject.save

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 6 LIMIT 1
---
  def edit
    @subject = Subject.find(params[:id])

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 6 LIMIT 1
UPDATE `subjects` SET `name` = 'TestSubject', `updated_at` = '2017-01-11 20:48:25' WHERE `subjects`.`id` = 6
---
def update
    # Instantiate a new object using form parameters
    @subject = Subject.find(params[:id])

    if @subject.update_attributes(subject_params)

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 6 LIMIT 1
---
  def delete
      @subject = Subject.find(params[:id])

DELETE FROM `subjects` WHERE `subjects`.`id` = 7
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 7 LIMIT 1
---
  def destroy
      subject = Subject.find(params[:id]).destroy